EDT.СЭ_Доработки/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="92fb5452-6c85-4d20-915a-3faee12eda7d">
    <name>ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="62e84758-ebd8-4b0e-8041-10d281b0efd1">
    <name>СЭ_ЧислоНомераДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7c6d994-38af-4143-83f1-344ed241e38b">
    <name>СЭ_ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebdebeb0-c9c8-4a30-a8f6-e775ddbbb151">
    <name>СЭ_РучнойВводНомераДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5c2fe7d-963d-45ea-aab5-dc5c03312402">
    <name>СЭ_ГодНомераДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a7ed73d5-070d-4d33-8879-54d3538b69d2">
    <name>СЭ_ДатаОкончания_ТД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

EDT.СЭ_Доработки/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8880d304-daf7-4345-ad8d-c81bc5d994b7">
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

EDT.СЭ_Доработки/src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

 
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура СЭ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Перем Ошибки;

	МассивНепроверяемыхРеквизитов = Новый Массив;

	// Дата начала действия договора должна быть не меньше, чем дата договора.
	Если ЗначениеЗаполнено(Дата) И ЗначениеЗаполнено(ДатаНачалаДействия) Тогда

		Если НачалоДня(Дата) > ДатаНачалаДействия Тогда

			ТекстОшибки = НСтр("ru = 'Дата начала действия договора должна быть не меньше даты договора';
			|en = 'Contract effective date cannot be less than the contract date'");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект, 
			"ДатаНачалаДействия",
			,
			Отказ);

		КонецЕсли;

	КонецЕсли;

	// Дата окончания действия договора должна быть не меньше, чем дата договора.
	Если ЗначениеЗаполнено(Дата) И ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда	

		Если НачалоДня(Дата) > ДатаОкончанияДействия Тогда

			ТекстОшибки = НСтр("ru = 'Дата окончания действия договора должна быть не меньше даты договора';
			|en = 'Contract expiration date cannot be less than the contract date'");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект, 
			"ДатаОкончанияДействия",
			,
			Отказ);

		КонецЕсли;

	КонецЕсли;

	// Дата окончания действия договора должна быть не меньше, чем дата начала действия.
	Если ЗначениеЗаполнено(ДатаНачалаДействия) И ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда	

		Если ДатаНачалаДействия > ДатаОкончанияДействия Тогда

			ТекстОшибки = НСтр("ru = 'Дата окончания действия договора должна быть не меньше даты начала действия';
			|en = 'Contract expiration date cannot be less than contract effective date'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект, 
			"ДатаОкончанияДействия",
			,
			Отказ);

		КонецЕсли;

	КонецЕсли;

	МассивНепроверяемыхРеквизитов.Добавить("Партнер");

	Если НЕ ЗначениеЗаполнено(Партнер) Тогда

		ТекстОшибки = НСтр("ru = 'Поле ""%1"" не заполнено';
		|en = 'Field %1 is required'");
		ЗаголовокПартнер = ПартнерыИКонтрагенты.ЗаголовокРеквизитаПартнерВЗависимостиОтХозяйственнойОперации(ХозяйственнаяОперация);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ЗаголовокПартнер);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект, 
		"Партнер",
		,
		Отказ);

	Иначе

		ОперацииЗакупки						  = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
		ОперацииИмпорта						  = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
		ОперацииВСтранахЕАЭС 				  = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
		ОперацииПроизводстваУПереработчика2_5 = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика2_5);

		ФлагиПартнера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Партнер, "Клиент, Поставщик");

		Если ФлагиПартнера.Клиент <> Истина И ФлагиПартнера.Поставщик <> Истина Тогда
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Для выбранного партнера должен быть установлен признак ""Клиент/Поставщик""';
			|en = 'The selected partner must have the Customer/Vendor checkbox selected'"),
			ЭтотОбъект, 
			"Партнер",
			,
			Отказ);

		ИначеЕсли ФлагиПартнера.Клиент <> Истина 
			И (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту

			//++ НЕ УТКА
			//++ Устарело_Переработка24
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья
			//-- Устарело_Переработка24
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья2_5
			//-- НЕ УТКА

			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера) Тогда
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Для выбранного партнера должен быть установлен признак ""Клиент""';
			|en = 'The selected partner must have the Customer checkbox selected'"),
			ЭтотОбъект, 
			"Партнер",
			,
			Отказ);

		ИначеЕсли ФлагиПартнера.Поставщик <> Истина
			И (ОперацииЗакупки.Найти(ХозяйственнаяОперация) <> Неопределено
			Или ОперацииИмпорта.Найти(ХозяйственнаяОперация) <> Неопределено
			Или ОперацииВСтранахЕАЭС.Найти(ХозяйственнаяОперация) <> Неопределено

			//++ НЕ УТ
			//++ Устарело_Переработка24
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика
			//-- Устарело_Переработка24
			Или ОперацииПроизводстваУПереработчика2_5.Найти(ХозяйственнаяОперация) <> Неопределено
			//-- НЕ УТ

			//++ НЕ УТКА
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья2_5
			//-- НЕ УТКА

			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи) Тогда
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Для выбранного партнера должен быть установлен признак ""Поставщик""';
			|en = 'The selected partner must have the Vendor checkbox selected'"),
			ЭтотОбъект, 
			"Партнер",
			,
			Отказ);
		КонецЕсли;

	КонецЕсли;

	Если Не УчетАгентскогоНДС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидАгентскогоДоговора");
	КонецЕсли;

	Если Не ТипДоговора = Перечисления.ТипыДоговоров.РеализацияЧерезКомиссионера Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КомиссионерПартнер");
		МассивНепроверяемыхРеквизитов.Добавить("КомиссионерКонтрагент");
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорСКомиссионером");
	КонецЕсли;

	ИспользоватьОформлениеЗакупок = (ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком
	Или ТипДоговора = Перечисления.ТипыДоговоров.ВвозИзЕАЭС
	Или ТипДоговора = Перечисления.ТипыДоговоров.Импорт);

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой")
		Или СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении
		Или Не ИспользоватьОформлениеЗакупок Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СпособДоставки");
		МассивНепроверяемыхРеквизитов.Добавить("ПеревозчикПартнер");
		МассивНепроверяемыхРеквизитов.Добавить("АдресДоставкиПеревозчика");
	КонецЕсли;

	ДоставкаТоваров.ПроверитьЗаполнениеРеквизитовДоставки(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);

	Если НалогообложениеНДСОпределяетсяВДокументе 
		Или ТипДоговора = Перечисления.ТипыДоговоров.Импорт
		//++ Устарело_Переработка24
		Или ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком
		//-- Устарело_Переработка24
		Или ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком2_5 
		Или ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком2_5_ЕАЭС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НалогообложениеНДС");
	КонецЕсли;

	Если ЗакупкаПодДеятельностьОпределяетсяВДокументе
		Или (ТипДоговора <> Перечисления.ТипыДоговоров.СПоставщиком
		//++ Устарело_Переработка24
		И ТипДоговора <> Перечисления.ТипыДоговоров.СПереработчиком
		//-- Устарело_Переработка24
		И ТипДоговора <> Перечисления.ТипыДоговоров.СПереработчиком2_5
		И ТипДоговора <> Перечисления.ТипыДоговоров.СПереработчиком2_5_ЕАЭС
		И ТипДоговора <> Перечисления.ТипыДоговоров.СПоклажедателем) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗакупкаПодДеятельность");
	КонецЕсли;

	Если ТипДоговора <> Перечисления.ТипыДоговоров.СПоклажедателем Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение");
		//++ НЕ УТ
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокОформленияСписанияВПроизводствоТоваровПринятыхНаХранение");
		//-- НЕ УТ
	КонецЕсли;

	//++ НЕ УТКА
	Если ТипДоговора <> Перечисления.ТипыДоговоров.СДавальцем
		И ТипДоговора <> Перечисления.ТипыДоговоров.СДавальцем2_5 Тогда
		//-- НЕ УТКА
		МассивНепроверяемыхРеквизитов.Добавить("Подразделение");
		//++ НЕ УТКА
	КонецЕсли;
	//-- НЕ УТКА

	Если ТипДоговора <> Перечисления.ТипыДоговоров.Субаренда Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорАренды");
	КонецЕсли;
	
	#Вставка
	
	//СЭ+ Евгений [16920]
	Если ТипДоговора <> Перечисления.ТипыДоговоров.СПокупателем Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СЭ_ТипДоговора");	
		МассивНепроверяемыхРеквизитов.Добавить("СЭ_ДатаОкончания_ТД");	
	КонецЕсли;
	//СЭ- Евгений [16920]
	
	////СЭ+ Евгений [16920]  УДАЛИТЬ ПОСЛЕ ПЕРЕНОСА ДОРАБОТОК В РАБОЧУЮ БАЗУ
	//МассивНепроверяемыхРеквизитов.Добавить("СЭ_ТипДоговора");	
	//МассивНепроверяемыхРеквизитов.Добавить("СЭ_ДатаОкончания_ТД");	
	////СЭ- Евгений [16920]
	
	#КонецВставки
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	ДоговорыКонтрагентовЛокализация.ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов, ЭтотОбъект);
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	Если ЗначениеЗаполнено(НаправлениеДеятельности) 
		И ТипДоговора = Перечисления.ТипыДоговоров.СКомитентомНаЗакупку Тогда
		РеквизитыНаправленияДеятельности = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НаправлениеДеятельности, "УчетДоходов, УчетЗатрат");
		Если Не РеквизитыНаправленияДеятельности.УчетДоходов
			ИЛИ Не РеквизитыНаправленияДеятельности.УчетЗатрат Тогда
			ТекстОшибки = НСтр("ru = 'Для поставки под принципала направление деятельности должно учитывать и доходы и затраты.';
			|en = 'For procurement outsourcing, the line of business must take into account both income and costs.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "НаправлениеДеятельности", , Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура СЭ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//СЭ+ Евгений [16920]
	ГодИзКонстанты = СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ПолучитьЗначениеКонстанты("СЭ_ГодДляНумератораДоговора");
	Если ГодИзКонстанты <> Неопределено И ЗначениеЗаполнено(ГодИзКонстанты) Тогда
		СЭ_ГодНомераДоговора = ГодИзКонстанты;	
	Иначе
		СЭ_ГодНомераДоговора = ТекущаяДата();
	КонецЕсли; 
	СЭ_ДатаОкончания_ТД = КонецГода(ГодИзКонстанты);
	
	тПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если ЗначениеЗаполнено(тПользователь.СЭ_ЗначениеВДоговор_Подразделение) Тогда
		Подразделение = тПользователь.СЭ_ЗначениеВДоговор_Подразделение;	
	КонецЕсли;
	Если ЗначениеЗаполнено(тПользователь.СЭ_ЗначениеВДоговор_СчетОрганизации) Тогда
		БанковскийСчет = тПользователь.СЭ_ЗначениеВДоговор_СчетОрганизации;	
	КонецЕсли;
	Если ЗначениеЗаполнено(тПользователь.СЭ_ЗначениеВДоговор_Валюта) Тогда
		ВалютаВзаиморасчетов = тПользователь.СЭ_ЗначениеВДоговор_Валюта;	
	КонецЕсли;
	Если ЗначениеЗаполнено(тПользователь.СЭ_ЗначениеВДоговор_ТипДоговора) Тогда
		СЭ_ТипДоговора = тПользователь.СЭ_ЗначениеВДоговор_ТипДоговора;	
	КонецЕсли;
	Если ЗначениеЗаполнено(тПользователь.СЭ_ЗначениеВДоговор_ДействуетС) Тогда
		ДатаНачалаДействия = тПользователь.СЭ_ЗначениеВДоговор_ДействуетС;	
	КонецЕсли;
	
	//Сроки (пока получаем данные из регистра в прив. режиме чтобы не обязывать ставить роли)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СЭ_УстановкаЗначенийСроковНаПериодСрезПоследних.Период КАК Период,
		|	СЭ_УстановкаЗначенийСроковНаПериодСрезПоследних.ВидСрокаДоговора КАК ВидСрокаДоговора,
		|	СЭ_УстановкаЗначенийСроковНаПериодСрезПоследних.ЗначениеСрока КАК ЗначениеСрока
		|ИЗ
		|	РегистрСведений.СЭ_УстановкаЗначенийСроковНаПериод.СрезПоследних(&Период, ) КАК СЭ_УстановкаЗначенийСроковНаПериодСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", НачалоГода(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидСрокаДоговора = ПредопределенноеЗначение("Перечисление.СЭ_ВидыСроковДоговора.СрокНаправленияСпециалистаСМоментаПолученияЗаявки") Тогда
			СЭ_СрокНаправленияСпециалистаСМоментаПолученияЗаявки = Выборка.ЗначениеСрока;	
		ИначеЕсли Выборка.ВидСрокаДоговора = ПредопределенноеЗначение("Перечисление.СЭ_ВидыСроковДоговора.СрокВыполнениРемонтаСМоментаПолученияЗаявки") Тогда
			СЭ_СрокВыполнениРемонтаСМоментаПолученияЗаявки = Выборка.ЗначениеСрока;	
		ИначеЕсли Выборка.ВидСрокаДоговора = ПредопределенноеЗначение("Перечисление.СЭ_ВидыСроковДоговора.СрокГарантииНаВыполненныеРаботы") Тогда
			СЭ_СрокГарантииНаВыполненныеРаботы = Выборка.ЗначениеСрока;	
		ИначеЕсли Выборка.ВидСрокаДоговора = ПредопределенноеЗначение("Перечисление.СЭ_ВидыСроковДоговора.СрокГарантииНаУстановленныЗЧ") Тогда
			СЭ_СрокГарантииНаУстановленныЗЧ = Выборка.ЗначениеСрока;	
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	//СЭ- Евгений [16920]
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура СЭ_ПередЗаписью(Отказ)
	
	//СЭ+ Евгений [16920]
	СЭ_СгенерироватьНомерДоговораДрайв();
	//СЭ- Евгений [16920]
		
КонецПроцедуры

//СЭ+ Евгений [16920]
Процедура СЭ_СгенерироватьНомерДоговораДрайв()
	
	//Если перезаписываем старый договор у которого уже сгенерирован номер, не пытаемся генерировать его снова
	Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.СЭ_РучнойВводНомераДоговора И ЗначениеЗаполнено(Ссылка.Номер) Тогда
		Возврат;
	КонецЕсли;
	
	СЭ_ЧислоНомераДоговора 	= 0;
	СЭ_ГодНомераДоговора 	= 0;

	Если ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") И НЕ СЭ_РучнойВводНомераДоговора Тогда
		
		ГодИзКонстанты = СЭ_ОбщегоНазначенияВызовСервераПривилегированный.ПолучитьЗначениеКонстанты("СЭ_ГодДляНумератораДоговора");
		Если ГодИзКонстанты <> Неопределено И ЗначениеЗаполнено(ГодИзКонстанты) Тогда
			СЭ_ГодНомераДоговора = Год(ГодИзКонстанты);	
		Иначе
			СЭ_ГодНомераДоговора = Год(ТекущаяДата());
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(ДоговорыКонтрагентов.СЭ_ЧислоНомераДоговора) КАК СЭ_ЧислоНомераДоговора,
			|	ДоговорыКонтрагентов.СЭ_ТипДоговора КАК СЭ_ТипДоговора
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.СЭ_РучнойВводНомераДоговора = ЛОЖЬ
			|	И ДоговорыКонтрагентов.СЭ_ТипДоговора = &СЭ_ТипДоговора
			|	И ДоговорыКонтрагентов.СЭ_ГодНомераДоговора = &СЭ_ГодНомераДоговора
			|
			|СГРУППИРОВАТЬ ПО
			|	ДоговорыКонтрагентов.СЭ_ТипДоговора";
		
		Запрос.УстановитьПараметр("СЭ_ТипДоговора", СЭ_ТипДоговора);
		Запрос.УстановитьПараметр("СЭ_ГодНомераДоговора", СЭ_ГодНомераДоговора);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			СЭ_ЧислоНомераДоговора 	= 1;
		Иначе
				
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СЭ_ЧислоНомераДоговора 	= Выборка.СЭ_ЧислоНомераДоговора + 1;
			КонецЦикла;
			
		КонецЕсли;
		
		Номер = СтрШаблон("%1%2/%3", Формат(СЭ_ЧислоНомераДоговора, "ЧГ=0"), СокрЛП(СЭ_ТипДоговора.КраткоеНаименование), Формат(СЭ_ГодНомераДоговора, "ЧГ=0")); 	
			
	КонецЕсли;
	

КонецПроцедуры
//СЭ- Евгений [16920]

#КонецЕсли
